{
  "basics": {
    "name": "Hunter Ma",
    "image": "",
    "email": "masibo@student.ubc.ca",
    "phone": "+1 (236) 967-4648",
    "location": {
      "address": "2712 Broadway St",
      "postalCode": "CA 94115",
      "city": "San Francisco",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "AlbertEinstein",
        "url": "https://twitter.com/AlbertEinstein"
      }
    ]
  },
  "education": [
    {
      "institution": "University of British Columbia",
      "location": "Vancouver, Canada",
      "url": "https://www.ubc.ca",
      "area": "4th year, specializing in robotics and autonomous systems",
      "studyType": "BASc in Engineering Physics",
      "startDate": "2022-09-01",
      "endDate": "2026-05-01",
      "score": "10",
      "courses": ["Machine learning including supervised and unsupervised learning, VAE, neural networks, and reinforcement Q-learning",
                  "Computer vision including SIFT feature detection and matching, stereo imaging, and structure from motion",
                  "Data structure and algorithms, software engineering",
                  "Control systems, signals and systems, circuit analysis",
                  "Calculus I-IV, applied linear algebra, optimization, ODE and PDE, complex analysis",
                  "Advanced classical mechanics, electromagnetism, quantum mechanics, special relativity"]
    }
  ],
  "work": [
    {
      "name": "Robotics and Control Lab, UBC",
      "position": "Undergraduate Machine Learning Research Assistant",
      "url": "https://rcl.ece.ubc.ca",
      "startDate": "2024-09-01",
      "endDate": "2024-12-20",
      "summary": "Conducted research under Dr. Purang Abolmaesumi on machine learning and computer vision with applications to medical imaging",
      "highlights": ["Developed and fine-tuned echocardiogram image segmentation pipeline using Florence 2 and SAM 2.",
                     "Benchmarked zero-shot and fine-tuned segmentation performance using MedSAM and SAM 2 on RCL's internal dataset, Stanford's EchoNet-Dynamic, and CAMUS dataset.",
                     "Incorporating Kalman Filter into semantic representation to assist video object segmentation and tracking."]
    },
    {
      "name": "Computer Vision for Smart Structure Lab, UWaterloo",
      "position": "Computer Vision and Robotics Research Scholar",
      "url": "https://cviss.net",
      "startDate": "2024-05-01",
      "endDate": "2024-08-20",
      "summary": "Conducted research under Dr. Chul Min Yeum on Gaussian Splatting neural volume rendering",
      "highlights": ["Applied spatial and semantic deep learning (SAM) computer vision methods for structural health monitoring.",
                     "Successfully accelerated training speed and rendeirng quality by incorporating monocular depth estimation and salient object detection to eliminate background.",
                     "Incorporated LiDAR SLAM into Gaussian Splatting to enhance camera pose estimation and aid UAV autonomy mission."]
    },
    {
      "name": "Microchip Technology",
      "position": "Hardware Engineering Intern",
      "url": "https://www.microchip.com",
      "startDate": "2023-01-01",
      "endDate": "2023-04-20",
      "summary": "Developed expertise in high-frequency analog and mixed-signal IC design and testing",
      "highlights": ["Conducted successful characterization of a real-time clock (RTC), gaining experience in the design, testing, and analysis of analog and mixed-signal ICs.",
                     "Performed phase-locked loop (PLL) analysis, gaining expertise in frequency and phase synchronization of circuits.",
                     "Conducted return loss analysis, developing skills in signal integrity analysis and design optimization of high-frequency circuits."]
    },
    {
      "name": "TRIUMF - Canada's National Particle Accelerator Center",
      "position": "Electronics R&D Research Assistant",
      "url": "https://www.triumf.ca",
      "startDate": "2021-09-01",
      "endDate": "2021-12-20",
      "summary": "Conducted research under Dr. Thomas Lindner on photomultiplier tubes for neutrino detection",
      "highlights": ["Successfully developed software enabling electronics mainboard read‐out and data analysis for multi‐photomultiplier tube (mPMT).",
                     "Created automated acquisition scripts to enable precise extraction of electronics pulse rates for both calibration and stringent quality control.",
                     "Photomultipliers will be used for world's largest neutrino oscillation detection experiment—Hyper-Kamiokande, in Japan."]
    }
  ],
  "projects": [
    {
      "name": "Control System Lead - UBC Orbit Satellite Design Team",
      "summary": "Currently working in Attitude and Orbit Control System (AOCS) subteam which encompasses attitude and orbit sensors, attitude estimation and guidance, attitude and orbit control algorithms, attitude control actuators for our 1U CubeSat.",
      "highlights": ["Co-developing a Python simulator for satellite attitude control in low Earth orbit, including magnetic actuator model, low-pass filter for onboard sensors, sensor fusion, and satellite system integration.",
                     "Developed optimized firmware for embedded systems using the TMS570 microcontroller, leveraging high-performance DSP library for signal analysis, filtering, and transformation, as well as advanced algorithms such as the Extended Kalman Filter and Sun Model.",
                     "Created training code for DSP library functions in C, providing examples and exercise for new team members.",
                     "CubeSat is scheduled to be launched by the European Space Agency in 2027, who provides training and testing facilities for our team."],
      "startDate": "2021-09-01",
      "endDate": "Present",
      "url": "https://www.ubcorbit.com"
    }
  ],
  "awards": [
    {
      "title": "Waterloo Engineering Rising Stars Fellowship",
      "date": "2024-03-06",
      "awarder": "University of Waterloo, Faculty of Engineering",
      "url": "https://uwaterloo.ca/engineering/waterloo-engineering-rising-stars-fellowship-program",
      "summary": "The fellowship recognizes exceptional engineering undergraduate students in Canada, offering them an opportunity to engage in cutting-edge engineering research under the mentorship of a University of Waterloo professor. The award includes a stipend of $5,500, along with full coverage of housing and meals, and a 50% reimbursement for travel expenses. Additionally, recipients will be granted a supplementary $2,000 award to support their future graduate studies."
    }
  ],
  "skills": [
    {
      "name": "Software",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Python",
        "C/C++",
        "Linux",
        "ROS 1/2",
        "OpenCV",
        "PyTorch",
        "TensorFlow",
        "MATLAB",
        "Java",
        "Assembly",
        "Git"
      ]
    },
    {
      "name": "Electrical",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Oscilloscope",
        "Spectrum analyzer",
        "Vector network analyzer",
        "Function generator",
        "Digital multimeter"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Chinese",
      "fluency": "Native speaker",
      "icon": ""
    }
  ]
}
